In [4]:
import os
import pandas as pd
import pathlib

# region dataset

In [22]:
list_color = ['RGB', 'grayscale']
list_image_size = ['256', '400', '512']
list_regions = ['Norte', 'Nordeste', 'Sul', 'Sudeste', 'Centro-Oeste']
list_minimum_image = ['5', '10', '20']
path_dataset = '/home/xandao/Documentos/dataset_gimp/imagens_regioes/imagens/'

for color in list_color:
    for image_size in list_image_size:
        for region in list_regions:
            for minimum_image in list_minimum_image:
                p = os.path.join(path_dataset, color, image_size, region, minimum_image)
                file_labels = [f for f in pathlib.Path(p).rglob('label2.txt') if f.is_file()]
                if len(file_labels) == 1:
                    df = pd.read_csv(file_labels[0], header=None, sep=';', names=['species', 'folder', 'count'])
                    display('color: %s image_size: %s minimum_image: %s regions: %s' % (color, image_size, minimum_image, region))
                    for folder_name in df['folder']:
                        df['list_images'] = str([str(image.stem) for image in pathlib.Path(os.path.join(p, folder_name)).rglob('*.jpeg') if image.is_file()])
                    display(df.head(5))
                    filename = '%s_%s_%s_%s.csv' % (color, image_size, region, minimum_image)
                    filename = os.path.join('csv', 'region', filename)
                    df.to_csv(filename, sep=';', header=None, index=None, lineterminator='\n')

'color: RGB image_size: 256 minimum_image: 5 regions: Norte'

,species,folder,count,list_images
0,piscatorum,f1,10,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
1,obliquum,f2,61,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
2,javariense,f3,11,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
3,coruscans,f4,13,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
4,brasiliense,f5,23,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."

'color: RGB image_size: 256 minimum_image: 10 regions: Norte'

,species,folder,count,list_images
0,piscatorum,f1,10,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
1,obliquum,f2,61,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
2,javariense,f3,11,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
3,coruscans,f4,13,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
4,brasiliense,f5,23,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."

'color: RGB image_size: 256 minimum_image: 20 regions: Norte'

,species,folder,count,list_images
0,obliquum,f1,61,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
1,brasiliense,f2,23,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
2,alatabaccum,f3,28,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
3,piresii,f4,38,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
4,reticulatum,f5,35,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."

'color: RGB image_size: 256 minimum_image: 5 regions: Nordeste'

,species,folder,count,list_images
0,fuligineum,f1,13,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
1,oreophila,f2,23,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
2,corcovadensis,f3,27,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
3,campinasana,f4,7,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
4,limai,f5,9,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."

'color: RGB image_size: 256 minimum_image: 10 regions: Nordeste'

,species,folder,count,list_images
0,fuligineum,f1,13,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
1,oreophila,f2,23,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
2,corcovadensis,f3,27,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
3,vicosanum,f4,12,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
4,sincorana,f5,47,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."

'color: RGB image_size: 256 minimum_image: 20 regions: Nordeste'

,species,folder,count,list_images
0,oreophila,f1,23,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
1,corcovadensis,f2,27,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
2,sincorana,f3,47,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
3,tetraphylla,f4,58,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
4,magnoliifolia,f5,21,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."

'color: RGB image_size: 256 minimum_image: 5 regions: Sul'

,species,folder,count,list_images
0,glaziovi,f1,5,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
1,fuligineum,f2,5,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
2,corcovadensis,f3,168,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
3,regnellii,f4,24,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
4,mikanianum,f5,72,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."

'color: RGB image_size: 256 minimum_image: 10 regions: Sul'

,species,folder,count,list_images
0,corcovadensis,f1,168,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
1,regnellii,f2,24,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
2,mikanianum,f3,72,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
3,reitzii,f4,20,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
4,miquelianum,f5,141,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."

'color: RGB image_size: 256 minimum_image: 20 regions: Sul'

,species,folder,count,list_images
0,corcovadensis,f1,168,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
1,regnellii,f2,24,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
2,mikanianum,f3,72,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
3,reitzii,f4,20,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
4,miquelianum,f5,141,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."

'color: RGB image_size: 256 minimum_image: 5 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
1,oreophila,f2,5,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
2,corcovadensis,f3,124,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
3,psilostachya,f4,7,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
4,regnellii,f5,55,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."

'color: RGB image_size: 256 minimum_image: 10 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
1,corcovadensis,f2,124,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
2,regnellii,f3,55,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
3,mikanianum,f4,18,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
4,vicosanum,f5,24,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."

'color: RGB image_size: 256 minimum_image: 20 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
1,corcovadensis,f2,124,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
2,regnellii,f3,55,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
3,vicosanum,f4,24,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
4,lhotzkyanum,f5,34,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."

'color: RGB image_size: 256 minimum_image: 5 regions: Centro-Oeste'

,species,folder,count,list_images
0,fuligineum,f1,77,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
1,campinasana,f2,7,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
2,regnellii,f3,40,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
3,aequale,f4,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
4,miquelianum,f5,8,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."

'color: RGB image_size: 256 minimum_image: 10 regions: Centro-Oeste'

,species,folder,count,list_images
0,fuligineum,f1,77,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
1,regnellii,f2,40,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
2,aequale,f3,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
3,crassinervium,f4,14,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
4,gardneriana,f5,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."

'color: RGB image_size: 256 minimum_image: 20 regions: Centro-Oeste'

      species folder  count                                        list_images
0  fuligineum     f1     77  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
1   regnellii     f2     40  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
2    elongata     f3     20  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
3    arboreum     f4    203  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
4    hispidum     f5     53  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...

'color: RGB image_size: 400 minimum_image: 5 regions: Norte'

,species,folder,count,list_images
0,piscatorum,f1,10,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
1,obliquum,f2,61,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
2,javariense,f3,11,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
3,coruscans,f4,13,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
4,brasiliense,f5,23,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."

'color: RGB image_size: 400 minimum_image: 10 regions: Norte'

,species,folder,count,list_images
0,piscatorum,f1,10,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
1,obliquum,f2,61,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
2,javariense,f3,11,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
3,coruscans,f4,13,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
4,brasiliense,f5,23,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."

'color: RGB image_size: 400 minimum_image: 20 regions: Norte'

,species,folder,count,list_images
0,obliquum,f1,61,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
1,brasiliense,f2,23,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
2,alatabaccum,f3,28,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
3,piresii,f4,38,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
4,reticulatum,f5,35,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."

'color: RGB image_size: 400 minimum_image: 5 regions: Nordeste'

,species,folder,count,list_images
0,fuligineum,f1,13,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
1,oreophila,f2,23,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
2,corcovadensis,f3,27,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
3,campinasana,f4,7,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
4,limai,f5,9,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."

'color: RGB image_size: 400 minimum_image: 10 regions: Nordeste'

,species,folder,count,list_images
0,fuligineum,f1,13,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
1,oreophila,f2,23,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
2,corcovadensis,f3,27,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
3,vicosanum,f4,12,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
4,sincorana,f5,47,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."

'color: RGB image_size: 400 minimum_image: 20 regions: Nordeste'

,species,folder,count,list_images
0,oreophila,f1,23,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
1,corcovadensis,f2,27,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
2,sincorana,f3,47,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
3,tetraphylla,f4,58,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
4,magnoliifolia,f5,21,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."

'color: RGB image_size: 400 minimum_image: 5 regions: Sul'

,species,folder,count,list_images
0,glaziovi,f1,5,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
1,fuligineum,f2,5,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
2,corcovadensis,f3,168,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
3,regnellii,f4,24,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
4,mikanianum,f5,72,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."

'color: RGB image_size: 400 minimum_image: 10 regions: Sul'

,species,folder,count,list_images
0,corcovadensis,f1,168,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
1,regnellii,f2,24,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
2,mikanianum,f3,72,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
3,reitzii,f4,20,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
4,miquelianum,f5,141,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."

'color: RGB image_size: 400 minimum_image: 20 regions: Sul'

,species,folder,count,list_images
0,corcovadensis,f1,168,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
1,regnellii,f2,24,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
2,mikanianum,f3,72,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
3,reitzii,f4,20,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
4,miquelianum,f5,141,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."

'color: RGB image_size: 400 minimum_image: 5 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
1,oreophila,f2,5,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
2,corcovadensis,f3,124,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
3,psilostachya,f4,7,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
4,regnellii,f5,55,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."

'color: RGB image_size: 400 minimum_image: 10 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
1,corcovadensis,f2,124,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
2,regnellii,f3,55,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
3,mikanianum,f4,18,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
4,vicosanum,f5,24,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."

'color: RGB image_size: 400 minimum_image: 20 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
1,corcovadensis,f2,124,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
2,regnellii,f3,55,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
3,vicosanum,f4,24,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
4,lhotzkyanum,f5,34,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."

'color: RGB image_size: 400 minimum_image: 5 regions: Centro-Oeste'

,species,folder,count,list_images
0,fuligineum,f1,77,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
1,campinasana,f2,7,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
2,regnellii,f3,40,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
3,aequale,f4,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
4,miquelianum,f5,8,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."

'color: RGB image_size: 400 minimum_image: 10 regions: Centro-Oeste'

,species,folder,count,list_images
0,fuligineum,f1,77,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
1,regnellii,f2,40,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
2,aequale,f3,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
3,crassinervium,f4,14,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
4,gardneriana,f5,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."

'color: RGB image_size: 400 minimum_image: 20 regions: Centro-Oeste'

      species folder  count                                        list_images
0  fuligineum     f1     77  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
1   regnellii     f2     40  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
2    elongata     f3     20  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
3    arboreum     f4    203  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
4    hispidum     f5     53  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...

'color: RGB image_size: 512 minimum_image: 5 regions: Norte'

,species,folder,count,list_images
0,piscatorum,f1,10,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
1,obliquum,f2,61,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
2,javariense,f3,11,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
3,coruscans,f4,13,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
4,brasiliense,f5,23,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."

'color: RGB image_size: 512 minimum_image: 10 regions: Norte'

,species,folder,count,list_images
0,piscatorum,f1,10,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
1,obliquum,f2,61,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
2,javariense,f3,11,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
3,coruscans,f4,13,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
4,brasiliense,f5,23,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."

'color: RGB image_size: 512 minimum_image: 20 regions: Norte'

,species,folder,count,list_images
0,obliquum,f1,61,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
1,brasiliense,f2,23,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
2,alatabaccum,f3,28,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
3,piresii,f4,38,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
4,reticulatum,f5,35,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."

'color: RGB image_size: 512 minimum_image: 5 regions: Nordeste'

,species,folder,count,list_images
0,fuligineum,f1,13,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
1,oreophila,f2,23,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
2,corcovadensis,f3,27,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
3,campinasana,f4,7,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
4,limai,f5,9,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."

'color: RGB image_size: 512 minimum_image: 10 regions: Nordeste'

,species,folder,count,list_images
0,fuligineum,f1,13,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
1,oreophila,f2,23,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
2,corcovadensis,f3,27,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
3,vicosanum,f4,12,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
4,sincorana,f5,47,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."

'color: RGB image_size: 512 minimum_image: 20 regions: Nordeste'

,species,folder,count,list_images
0,oreophila,f1,23,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
1,corcovadensis,f2,27,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
2,sincorana,f3,47,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
3,tetraphylla,f4,58,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
4,magnoliifolia,f5,21,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."

'color: RGB image_size: 512 minimum_image: 5 regions: Sul'

,species,folder,count,list_images
0,glaziovi,f1,5,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
1,fuligineum,f2,5,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
2,corcovadensis,f3,168,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
3,regnellii,f4,24,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
4,mikanianum,f5,72,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."

'color: RGB image_size: 512 minimum_image: 10 regions: Sul'

,species,folder,count,list_images
0,corcovadensis,f1,168,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
1,regnellii,f2,24,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
2,mikanianum,f3,72,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
3,reitzii,f4,20,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
4,miquelianum,f5,141,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."

'color: RGB image_size: 512 minimum_image: 20 regions: Sul'

,species,folder,count,list_images
0,corcovadensis,f1,168,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
1,regnellii,f2,24,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
2,mikanianum,f3,72,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
3,reitzii,f4,20,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
4,miquelianum,f5,141,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."

'color: RGB image_size: 512 minimum_image: 5 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
1,oreophila,f2,5,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
2,corcovadensis,f3,124,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
3,psilostachya,f4,7,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
4,regnellii,f5,55,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."

'color: RGB image_size: 512 minimum_image: 10 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
1,corcovadensis,f2,124,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
2,regnellii,f3,55,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
3,mikanianum,f4,18,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
4,vicosanum,f5,24,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."

'color: RGB image_size: 512 minimum_image: 20 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
1,corcovadensis,f2,124,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
2,regnellii,f3,55,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
3,vicosanum,f4,24,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
4,lhotzkyanum,f5,34,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."

'color: RGB image_size: 512 minimum_image: 5 regions: Centro-Oeste'

,species,folder,count,list_images
0,fuligineum,f1,77,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
1,campinasana,f2,7,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
2,regnellii,f3,40,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
3,aequale,f4,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
4,miquelianum,f5,8,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."

'color: RGB image_size: 512 minimum_image: 10 regions: Centro-Oeste'

,species,folder,count,list_images
0,fuligineum,f1,77,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
1,regnellii,f2,40,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
2,aequale,f3,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
3,crassinervium,f4,14,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
4,gardneriana,f5,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."

'color: RGB image_size: 512 minimum_image: 20 regions: Centro-Oeste'

      species folder  count                                        list_images
0  fuligineum     f1     77  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
1   regnellii     f2     40  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
2    elongata     f3     20  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
3    arboreum     f4    203  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
4    hispidum     f5     53  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...

'color: grayscale image_size: 256 minimum_image: 5 regions: Norte'

,species,folder,count,list_images
0,piscatorum,f1,10,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
1,obliquum,f2,61,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
2,javariense,f3,11,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
3,coruscans,f4,13,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
4,brasiliense,f5,23,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."

'color: grayscale image_size: 256 minimum_image: 10 regions: Norte'

,species,folder,count,list_images
0,piscatorum,f1,10,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
1,obliquum,f2,61,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
2,javariense,f3,11,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
3,coruscans,f4,13,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
4,brasiliense,f5,23,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."

'color: grayscale image_size: 256 minimum_image: 20 regions: Norte'

,species,folder,count,list_images
0,obliquum,f1,61,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
1,brasiliense,f2,23,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
2,alatabaccum,f3,28,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
3,piresii,f4,38,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
4,reticulatum,f5,35,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."

'color: grayscale image_size: 256 minimum_image: 5 regions: Nordeste'

,species,folder,count,list_images
0,fuligineum,f1,13,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
1,oreophila,f2,23,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
2,corcovadensis,f3,27,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
3,campinasana,f4,7,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
4,limai,f5,9,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."

'color: grayscale image_size: 256 minimum_image: 10 regions: Nordeste'

,species,folder,count,list_images
0,fuligineum,f1,13,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
1,oreophila,f2,23,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
2,corcovadensis,f3,27,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
3,vicosanum,f4,12,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
4,sincorana,f5,47,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."

'color: grayscale image_size: 256 minimum_image: 20 regions: Nordeste'

,species,folder,count,list_images
0,oreophila,f1,23,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
1,corcovadensis,f2,27,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
2,sincorana,f3,47,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
3,tetraphylla,f4,58,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
4,magnoliifolia,f5,21,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."

'color: grayscale image_size: 256 minimum_image: 5 regions: Sul'

,species,folder,count,list_images
0,glaziovi,f1,5,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
1,fuligineum,f2,5,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
2,corcovadensis,f3,168,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
3,regnellii,f4,24,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
4,mikanianum,f5,72,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."

'color: grayscale image_size: 256 minimum_image: 10 regions: Sul'

,species,folder,count,list_images
0,corcovadensis,f1,168,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
1,regnellii,f2,24,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
2,mikanianum,f3,72,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
3,reitzii,f4,20,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
4,miquelianum,f5,141,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."

'color: grayscale image_size: 256 minimum_image: 20 regions: Sul'

,species,folder,count,list_images
0,corcovadensis,f1,168,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
1,regnellii,f2,24,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
2,mikanianum,f3,72,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
3,reitzii,f4,20,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
4,miquelianum,f5,141,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."

'color: grayscale image_size: 256 minimum_image: 5 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
1,oreophila,f2,5,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
2,corcovadensis,f3,124,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
3,psilostachya,f4,7,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
4,regnellii,f5,55,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."

'color: grayscale image_size: 256 minimum_image: 10 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
1,corcovadensis,f2,124,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
2,regnellii,f3,55,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
3,mikanianum,f4,18,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
4,vicosanum,f5,24,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."

'color: grayscale image_size: 256 minimum_image: 20 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
1,corcovadensis,f2,124,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
2,regnellii,f3,55,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
3,vicosanum,f4,24,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
4,lhotzkyanum,f5,34,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."

'color: grayscale image_size: 256 minimum_image: 5 regions: Centro-Oeste'

,species,folder,count,list_images
0,fuligineum,f1,77,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
1,campinasana,f2,7,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
2,regnellii,f3,40,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
3,aequale,f4,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
4,miquelianum,f5,8,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."

'color: grayscale image_size: 256 minimum_image: 10 regions: Centro-Oeste'

,species,folder,count,list_images
0,fuligineum,f1,77,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
1,regnellii,f2,40,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
2,aequale,f3,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
3,crassinervium,f4,14,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
4,gardneriana,f5,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."

'color: grayscale image_size: 256 minimum_image: 20 regions: Centro-Oeste'

      species folder  count                                        list_images
0  fuligineum     f1     77  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
1   regnellii     f2     40  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
2    elongata     f3     20  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
3    arboreum     f4    203  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
4    hispidum     f5     53  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...

'color: grayscale image_size: 400 minimum_image: 5 regions: Norte'

,species,folder,count,list_images
0,piscatorum,f1,10,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
1,obliquum,f2,61,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
2,javariense,f3,11,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
3,coruscans,f4,13,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
4,brasiliense,f5,23,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."

'color: grayscale image_size: 400 minimum_image: 10 regions: Norte'

,species,folder,count,list_images
0,piscatorum,f1,10,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
1,obliquum,f2,61,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
2,javariense,f3,11,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
3,coruscans,f4,13,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
4,brasiliense,f5,23,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."

'color: grayscale image_size: 400 minimum_image: 20 regions: Norte'

,species,folder,count,list_images
0,obliquum,f1,61,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
1,brasiliense,f2,23,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
2,alatabaccum,f3,28,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
3,piresii,f4,38,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
4,reticulatum,f5,35,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."

'color: grayscale image_size: 400 minimum_image: 5 regions: Nordeste'

,species,folder,count,list_images
0,fuligineum,f1,13,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
1,oreophila,f2,23,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
2,corcovadensis,f3,27,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
3,campinasana,f4,7,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
4,limai,f5,9,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."

'color: grayscale image_size: 400 minimum_image: 10 regions: Nordeste'

,species,folder,count,list_images
0,fuligineum,f1,13,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
1,oreophila,f2,23,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
2,corcovadensis,f3,27,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
3,vicosanum,f4,12,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
4,sincorana,f5,47,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."

'color: grayscale image_size: 400 minimum_image: 20 regions: Nordeste'

,species,folder,count,list_images
0,oreophila,f1,23,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
1,corcovadensis,f2,27,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
2,sincorana,f3,47,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
3,tetraphylla,f4,58,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
4,magnoliifolia,f5,21,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."

'color: grayscale image_size: 400 minimum_image: 5 regions: Sul'

,species,folder,count,list_images
0,glaziovi,f1,5,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
1,fuligineum,f2,5,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
2,corcovadensis,f3,168,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
3,regnellii,f4,24,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
4,mikanianum,f5,72,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."

'color: grayscale image_size: 400 minimum_image: 10 regions: Sul'

,species,folder,count,list_images
0,corcovadensis,f1,168,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
1,regnellii,f2,24,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
2,mikanianum,f3,72,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
3,reitzii,f4,20,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
4,miquelianum,f5,141,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."

'color: grayscale image_size: 400 minimum_image: 20 regions: Sul'

,species,folder,count,list_images
0,corcovadensis,f1,168,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
1,regnellii,f2,24,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
2,mikanianum,f3,72,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
3,reitzii,f4,20,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
4,miquelianum,f5,141,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."

'color: grayscale image_size: 400 minimum_image: 5 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
1,oreophila,f2,5,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
2,corcovadensis,f3,124,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
3,psilostachya,f4,7,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
4,regnellii,f5,55,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."

'color: grayscale image_size: 400 minimum_image: 10 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
1,corcovadensis,f2,124,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
2,regnellii,f3,55,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
3,mikanianum,f4,18,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
4,vicosanum,f5,24,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."

'color: grayscale image_size: 400 minimum_image: 20 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
1,corcovadensis,f2,124,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
2,regnellii,f3,55,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
3,vicosanum,f4,24,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
4,lhotzkyanum,f5,34,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."

'color: grayscale image_size: 400 minimum_image: 5 regions: Centro-Oeste'

,species,folder,count,list_images
0,fuligineum,f1,77,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
1,campinasana,f2,7,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
2,regnellii,f3,40,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
3,aequale,f4,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
4,miquelianum,f5,8,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."

'color: grayscale image_size: 400 minimum_image: 10 regions: Centro-Oeste'

,species,folder,count,list_images
0,fuligineum,f1,77,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
1,regnellii,f2,40,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
2,aequale,f3,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
3,crassinervium,f4,14,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
4,gardneriana,f5,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."

'color: grayscale image_size: 400 minimum_image: 20 regions: Centro-Oeste'

      species folder  count                                        list_images
0  fuligineum     f1     77  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
1   regnellii     f2     40  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
2    elongata     f3     20  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
3    arboreum     f4    203  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
4    hispidum     f5     53  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...

'color: grayscale image_size: 512 minimum_image: 5 regions: Norte'

,species,folder,count,list_images
0,piscatorum,f1,10,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
1,obliquum,f2,61,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
2,javariense,f3,11,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
3,coruscans,f4,13,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."
4,brasiliense,f5,23,"['INPA0179861', 'INPA0023412', 'NY01421846_01'..."

'color: grayscale image_size: 512 minimum_image: 10 regions: Norte'

,species,folder,count,list_images
0,piscatorum,f1,10,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
1,obliquum,f2,61,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
2,javariense,f3,11,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
3,coruscans,f4,13,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
4,brasiliense,f5,23,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."

'color: grayscale image_size: 512 minimum_image: 20 regions: Norte'

,species,folder,count,list_images
0,obliquum,f1,61,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
1,brasiliense,f2,23,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
2,alatabaccum,f3,28,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
3,piresii,f4,38,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."
4,reticulatum,f5,35,"['NY01397567_01', 'IAN011429', 'NY01397566_01'..."

'color: grayscale image_size: 512 minimum_image: 5 regions: Nordeste'

,species,folder,count,list_images
0,fuligineum,f1,13,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
1,oreophila,f2,23,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
2,corcovadensis,f3,27,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
3,campinasana,f4,7,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
4,limai,f5,9,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."

'color: grayscale image_size: 512 minimum_image: 10 regions: Nordeste'

,species,folder,count,list_images
0,fuligineum,f1,13,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
1,oreophila,f2,23,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
2,corcovadensis,f3,27,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
3,vicosanum,f4,12,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."
4,sincorana,f5,47,"['MBM116011', 'SPF00164804', 'ALCB002302', 'SP..."

'color: grayscale image_size: 512 minimum_image: 20 regions: Nordeste'

,species,folder,count,list_images
0,oreophila,f1,23,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
1,corcovadensis,f2,27,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
2,sincorana,f3,47,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
3,tetraphylla,f4,58,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."
4,magnoliifolia,f5,21,"['SPF00048717', 'SPF00082803', 'NY00555600_01'..."

'color: grayscale image_size: 512 minimum_image: 5 regions: Sul'

,species,folder,count,list_images
0,glaziovi,f1,5,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
1,fuligineum,f2,5,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
2,corcovadensis,f3,168,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
3,regnellii,f4,24,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
4,mikanianum,f5,72,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."

'color: grayscale image_size: 512 minimum_image: 10 regions: Sul'

,species,folder,count,list_images
0,corcovadensis,f1,168,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
1,regnellii,f2,24,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
2,mikanianum,f3,72,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
3,reitzii,f4,20,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."
4,miquelianum,f5,141,"['MBM037883', 'NY00559096_01', 'MBM045085', 'M..."

'color: grayscale image_size: 512 minimum_image: 20 regions: Sul'

,species,folder,count,list_images
0,corcovadensis,f1,168,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
1,regnellii,f2,24,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
2,mikanianum,f3,72,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
3,reitzii,f4,20,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."
4,miquelianum,f5,141,"['MBM089701', 'MBM089707', 'CEN00047117', 'FUR..."

'color: grayscale image_size: 512 minimum_image: 5 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
1,oreophila,f2,5,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
2,corcovadensis,f3,124,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
3,psilostachya,f4,7,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."
4,regnellii,f5,55,"['MBM084431', 'INPA0124667', 'SP011164', 'NY00..."

'color: grayscale image_size: 512 minimum_image: 10 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
1,corcovadensis,f2,124,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
2,regnellii,f3,55,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
3,mikanianum,f4,18,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
4,vicosanum,f5,24,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."

'color: grayscale image_size: 512 minimum_image: 20 regions: Sudeste'

,species,folder,count,list_images
0,fuligineum,f1,79,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
1,corcovadensis,f2,124,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
2,regnellii,f3,55,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
3,vicosanum,f4,24,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."
4,lhotzkyanum,f5,34,"['ESA031454', 'NY00559090_01', 'MBM084435', 'S..."

'color: grayscale image_size: 512 minimum_image: 5 regions: Centro-Oeste'

,species,folder,count,list_images
0,fuligineum,f1,77,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
1,campinasana,f2,7,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
2,regnellii,f3,40,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
3,aequale,f4,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
4,miquelianum,f5,8,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."

'color: grayscale image_size: 512 minimum_image: 10 regions: Centro-Oeste'

,species,folder,count,list_images
0,fuligineum,f1,77,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
1,regnellii,f2,40,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
2,aequale,f3,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
3,crassinervium,f4,14,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."
4,gardneriana,f5,15,"['NY00679960_01', 'NY00956929_01', 'MBM250545'..."

'color: grayscale image_size: 512 minimum_image: 20 regions: Centro-Oeste'

      species folder  count                                        list_images
0  fuligineum     f1     77  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
1   regnellii     f2     40  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
2    elongata     f3     20  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
3    arboreum     f4    203  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...
4    hispidum     f5     53  ['CEN00036424', 'UEC149671', 'NY00885318_01', ...